// Please see documentation at https://docs.microsoft.com/aspnet/core/client-side/bundling-and-minification
// for details on configuring this project to bundle and minify static web assets.

// Write your JavaScript code.

let Data = [
    {
        Id: 1,
        Name: "ฮานาโกะซัง ในห้องน้ำ",
        Level: "ถ้าอยากเจอ ก็ลองดู",
        Story: "\tเรื่องผีที่ติดอันดับเข้ามาตลอด และเด็กไทยเองก็น่าจะรู้จักเหมือนกัน สำหรับผีฮานาโกะที่สิงสู่อยู่ตามห้องน้ำ เล่ากันว่า หากเคาะประตูห้องน้ำที่ชั้นสาม เคาะสามครั้งแล้วถามว่า “ฮานาโกะซังอยู่ไหม” หากมีเสียงตอบว่า “ไฮ่” ประตูก็จะเปิดออก และมีเด็กผู้หญิงใส่กระโปรงสีแดงลากตัวเราไป สถานที่จะพบเจอได้ต้องเป็นห้องน้ำเด็กผู้หญิงเวลาหลังเลิกเรียน"
        , Explanation: "\tฮานาโกะนั้นเป็นเรื่องผีที่อาจมีรายละเอียดที่แตกต่างกันในในแต่ละโรงเรียนด้วย น่าจะเพื่ออัพเดทให้มีความน่ากลัวเข้ากับที่ตรงนั้นนั่นเอง ส่วนความเป็นมาของฮานาโกะนั้น เชื่อกันว่าเธอเป็นเด็กที่เสียชีวิตในช่วงสงครามโลกขณะที่มีเครื่องบินมาทิ้งระเบิด เธอได้หนีเข้าไปหลบในห้องน้ำ ผลก็คือเปลวเพลิงจากระเบิดครอกตายทั้งเป็น นั่นจึงทำให้ดวงวิญญาณของเธอต้องคอยเร่ร่อนไปมาในห้องน้ำ"
        , Image: "https://pbs.twimg.com/media/EC5cIibUcAAyxRU.jpg"
    },
    {
        Id: 2,
        Name: "ตำนานเสาหลักเมืองของญี่ปุ่น",
        Level: "น่าขนลุก",
        Story: "\tฮิโตบาชิระ เป็นชื่อเรียกของพิธีบูชายัญที่ใช้มนุษย์ทั้งเป็น ฝังไว้ใต้หรือใกล้อาคารใหญ่ ตามเขื่อน, สะพาน และปราสาทในยุคก่อน เพื่อเป็นคำอธิษฐานต่อเทพเจ้าให้การก่อสร้างสำเร็จลุล่วง และไม่ให้อาคารโดนทำลายจากธรรมชาติหรือการโจมตีของศัตรู"
        , Explanation: "\tตำนานเสามนุษย์ที่ขึ้นชื่อที่สุดก็คือที่ ปราสาทมารุโอกะ จังหวัดฟุคุอิ หนึ่งในปราสาทไม้ที่เก่าแก่ และสวยงามที่สุดของญี่ปุ่น แต่ก่อนการก่อสร้างนั้นลำบากมาก ไม่ว่าจะพยายามสร้างกี่ครั้งเสาหินก็จะถล่มลงมาเสมอ แม่ม่ายนามว่า โอชิซึ จึงถูกนำตัวมาเป็นเครื่องสังเวย โดยมีข้อแลกเปลี่ยนคือให้ลูกชายของโอชิซึจะได้เข้ามาเป็นซามูไรรับใช้ในปราสาท เธอถูกฝังทั้งเป็นใต้เสาหลัก และหลังจากนั้นการก่อสร้างปราสาทก็เป็นไปอย่างราบรื่น"
        , Image: "https://www.jnto.or.th/wp-content/uploads/2017/12/kansai-temple-13.jpg"
    },
    {
        Id: 3,
        Name: "Test",
        Level: "น่าขนลุก",
        Story: "หนึ่งในปราสาทที่สวยงาม และโด่งดังที่สุดของญี่ปุ่น ปราสาทฮิเมจิ เองก็มีเรื่องเล่าอยู่เช่นกัน ถึงเรื่องราวการปรากฏตัวของวิญญาณผีสาวข้างบ่อน้ำ แล้วออกเสียงนับจานอย่างช้าๆ กระทั่งนับถึงใบที่ 9 เธอจะเริ่มร้องไห้ ส่งเสียงโหยหวนชวนขนหัวลุก",
        Explanation: "ตำนานเล่าว่า โอคิคุเป็นสาวใช้ของซามูไรนามว่า อาโอยามา เท็ตซัน เขาตกหลุมรักเธอจึงได้วางแผนหลอกด้วยการนำชุดเครื่องจานราคาแพงจากดัตช์ มามอบให้เป็นหน้าที่ของโอคิคุคอยดูแล วันหนึ่งเขาจึงนำจานหนึ่งใบไปซ่อน แล้วสั่งสาวใช้ให้นำชามทั้ง 10 ใบมาให้ เมื่อโอคิคุไม่สามารถหาได้ครบ เธอจึงหวาดกลัวว่าจะถูกลงโทษ เท็ตซันจึงยื่นข้อเสนอจะยกโทษให้หากเธอยอมเป็นภรรยาน้อยของเขา โอคิคุไม่ยอม และเลือกที่จะรักษาเกียรติของตนด้วยการกระโดดลงบ่อน้ำ จบชีวิตของตนลงในที่สุด",
        Image: "https://usercontent.2th.me/a/i/h03yt3rc/2th.me_544610.jpg"
    },
    {
        Id: 4,
        Name: "เทเคะเทเคะ",
        Level: "อันตราย",
        Story: "เทเคะเทเคะ เป็นการจำลองเสียง ครืด ครืด คล้ายมีสิ่งของถูกลากไปมา เพียงแต่สิ่งของที่ว่านั้นคือ “ร่างกายครึ่งบน” ของมนุษย์นั่นเอง",
        Explanation: "ทเคะเทเคะนั้น เกิดจากหญิงสาวคนหนึ่งที่ถูกทำร้าย และข่มขืน เธอตัดสินใจกระโดดฆ่าตัวตายลงบนทางรถไฟ ร่างของเธอถูกรถไฟทับจนขาดครึ่งท่อน แต่ด้วยความหนาวเย็นของอากาศในตอนนั้นทำให้เธอไม่ตายในทันที และต้องทรมานอยู่อย่างนั้นจนกว่าจะขาดใจตาย กลายเป็นวิญญาณอาฆาตที่จะฆ่าทุกคนที่โชคร้ายไปเจอเธอเข้า โดยจะตัดร่างของเหยื่อเป็นสองท่อน และเอาร่างท่อนล่างไป",
        Image: "https://scontent.xx.fbcdn.net/v/t1.6435-9/37969507_2228265107188890_8546127209776021504_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=7afa59&_nc_ohc=xgn5DHHHv2IAX-AUGBa&_nc_ht=scontent.xx&edm=AN6CN6oEAAAA&oh=00_AfCPdRgzsQ85qvUtgzEb4w0Z0_xrU84GtpCV6CK4wR85uQ&oe=659770D3"
    },
    {
        Id: 5,
        Name: "Test",
        Level: "none",
        Story: "none",
        Explanation: "",
        Image: "https://usercontent.2th.me/a/i/h03yt3rc/2th.me_544610.jpg"
    }
]